---
kind: enumMember
id: F:Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationTop
enum: Autodesk.Revit.DB.AssemblyDetailViewOrientation
source: html/941c2468-0a94-b2c0-0c73-1953e15487d6.htm
---
# Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationTop

The Detail View will be oriented horizontally, with its cut plane along the top face of the assembly's bounding box, looking down into the bounding box.